app/controllers/container_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def create_user_backup
    vpses = Vps.find(:all, :conditions => "user_id = '#{params[:dump][:user_id]}'")
    user = User.find(params[:dump][:user_id])