app/controllers/user_containers_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
	def list_vps
		@status = params[:status]
		@user = User.find_by_id(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
	def backups
		vpses = Vps.find(:all, :conditions => "user_id = '#{params[:id]}'")
		user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
	def restore
	    vpses = Vps.find(:all, :conditions => "user_id = '#{params[:dump_id][:id]}'")
		user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
	def delete_dump
		user = User.find(params[:id])